app/controllers/entry_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1
INSERT INTO "entries" ("updated_at", "weight", "notes", "user_id", "entry_date", "created_at") VALUES('2009-07-14 04:44:41.242372', 240.0, E'another test', 3, NULL, '2009-07-14 04:44:41.242372') RETURNING "id"
---
  def new

    if param_posted?(:entry) #request.post? and params[:user]

      @user = User.find_by_id(session[:user_id])
      @user.entries << Entry.new(params[:entry])

SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1
SELECT * FROM "entries" WHERE ("entries"."user_id" = 3 AND "entries"."entry_date" = E'2009-08-18') LIMIT 1
UPDATE "entries" SET "updated_at" = '2009-08-12 02:58:02.784318', "notes" = E'Tested' WHERE "id" = 16
INSERT INTO "entries" ("created_at", "notes", "updated_at", "weight", "user_id", "entry_date") VALUES('2009-08-08 04:18:16.366911', E'Test', '2009-08-08 04:18:16.366911', 232.0, 3, NULL) RETURNING "id"
SELECT "entries".id FROM "entries" WHERE ("entries"."entry_date" = '2009-08-10' AND "entries".id <> 16) LIMIT 1
---
  def view

#    @context_links = [['Yesterday', 'view', 'entry', Date.yesterday.to_s(:db)],
#                      ['Tomorrow', 'view', 'entry', 'tomorrow']]

    @user = User.find_by_id(session[:user_id])
    @logentries = Entry.fetchLogList(session[:user_id])

    if params[:id] == nil then
      entry_date = Date.today.to_s(:db)
    else
      entry_date = params[:id]
    end

    if param_posted?(:entry)

      if(@entry = Entry.find_by_user_id_and_entry_date(session[:user_id], entry_date)) then
        @entry.attributes = params[:entry];
        @entry.save;
      else
        @entry = Entry.new(params[:entry])
        @user.entries << @entry
        @user.save
      end
    else
      @entry = Entry.find_by_user_id_and_entry_date(session[:user_id], entry_date) ||
               Entry.new(:entry_date => entry_date)

SELECT "entries".id FROM "entries" WHERE ("entries"."entry_date" = '2009-08-18' AND "entries".id <> 17) LIMIT 1
UPDATE "entries" SET "updated_at" = '2009-08-19 03:59:00.734588', "notes" = E'Testing' WHERE "id" = 17
---
  def entry_attribute

   if (request.xhr?)

     @entry = Entry.find_by_user_id_and_entry_date(session[:user_id], params[:entry_date]) ||
              Entry.new(:entry_date => params[:entry_date], :user_id => session[:user_id])

     @entry[params[:id]]= params[:value];

     @entry.save;