app/controllers/users_controller.rb

  def index


    @context_links = [['New', 'new', 'entry']]
    @user = User.find_by_id(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1

  def new
    @title = "Create"

    if param_posted?(:user) #request.post? and params[:user]
      @user = User.new(params[:user])
      if @user.save
---
INSERT INTO "users" ("updated_at", "screen_name", "password", "created_at", "email") VALUES('2009-06-11 05:37:38.480618', E'slimJiggery', E'45alive', '2009-06-11 05:37:38.480618', E'bob@bobbery.net') RETURNING "id"

  def login

      @title = "Log in to Health Log"

      if request.get?
        @user = User.new(:remember_me => remember_me_string)
      elsif param_posted?(:user)
      	 @user = User.new(params[:user])
	 user = User.find_by_screen_name_and_password(@user.screen_name,
						      @user.password)
---
SELECT * FROM "users" WHERE ("users"."screen_name" = E'Bridgier' AND "users"."password" = E'45alive') LIMIT 1